package my.DB_course_paper;

/*
 * To change this license header, choose License Headers in Project Properties.
 * To change this template file, choose Tools | Templates
 * and open the template in the editor.
 */
import javax.swing.table.*;
/**
 *
 * @author Matt
 */
public class TableTemplates {
    private DefaultTableModel [] tables;//модели таблиц для ухода от накоплений данных
    TableTemplates(){
    tables=new DefaultTableModel[20];
    tables[0]= new DefaultTableModel(
    new Object [][] {},
    new String [] {
        "ID", "Имя", "Фамилия", "Отчество", "Пол", "Дата рождения", "Зарплата", "Режим работы", "Образование", "Отдел", "Группа"//таблица "Сотрудники"
    }); 
    tables[1]=new DefaultTableModel(
    new Object [][] {},
    new String [] {
        "ID", "Имя", "Фамилия", "Отчество", "Образование", "Должность", "Стаж работы","Категория","Научная степень","Специализация"//таблица "Инженеры"
    }); 
    tables[2]=new DefaultTableModel( new Object [][] {},
    new String [] {
        "ID", "Имя", "Фамилия", "Отчество", "Образование", "Должность", "Стаж работы","Количество патентов","Научная степень","Область разработок"
    });//таблица "Конструкторы"
    tables[3]=new DefaultTableModel( new Object [][] {},
    new String [] {
        "ID", "Имя", "Фамилия", "Отчество", "Образование", "Должность", "Стаж работы","Число публикаций","Сфера исследований","Число исследований"
    });//таблица "Лаборанты"
    tables[4]=new DefaultTableModel( new Object [][] {},
    new String [] {
        "ID", "Имя", "Фамилия", "Отчество", "Образование", "Должность", "Стаж работы","Количество оборудования","Специализация"
    });//таблица "Техники"
    tables[5]=new DefaultTableModel(
     new Object [][] {},
    new String [] {
        "ID", "Имя", "Фамилия", "Отчество", "Образование", "Должность", "Стаж работы","Вид обслуживания"
    });//таблица "Обслуживающий персонал"
    tables[6]=new DefaultTableModel(new Object [][] {},
    new String [] {
        "ID", "Имя", "Фамилия", "Отчество", "Образование", "Должность", "Стаж работы","Дата назначения"
    });//таблица "Начальники отделов"
    tables[7]=new DefaultTableModel(
    new Object [][] {},
    new String [] {
        "ID", "Имя", "Фамилия", "Отчество", "Образование", "Должность", "Стаж работы","Научная степень", "Структура" //таблица "Руководители"
    }); 
    tables[8]=new DefaultTableModel(
    new Object [][] {},
    new String [] {
        "ID отдела", "Имя начальника", "Фамилия", "Отчество", "Количество сотрудников", "Направление деятельности"//таблица "Отделы"
    }); 
    tables[9]=new DefaultTableModel(
    new Object [][] {},
    new String [] {
        "ID договора", "Общая стоимость", "Общие затраты времени", "Дата заключения", "Заказчик", "Телефон заказчика", "Процент выполнения", "ID руководителя", "Имя", "Фамилия", "Отчество" //таблица "Договоры"
    }); 
    tables[10]=new DefaultTableModel(
    new Object [][] {},
    new String [] {
        "ID проекта", "Срок сдачи", "Стоимость", "Объём работ", "Дата старта", "Дата выполнения", "Статус", "ID договора", "ID руководителя", "Имя", "Фамилия", "Отчество"//таблица "Проекты"
    });
    tables[11]=new DefaultTableModel(
    new Object [][] {},
    new String [] {
        "ID оборудования", "Тип оборудования", "Производитель", "Срок работы", "Рабочая нагрузка", "ID группы", "ID отдела"//таблица "Оборудование"
    });
    tables[12]=new DefaultTableModel(
    new Object [][] {},
    new String [] {
        "ID субподрядчика", "Название организации", "Адрес", "Контактный телефон", "Стоимость найма", "Переданный объём работ", "Сроки сдачи", "ID проекта"//таблица "Субподрядчик"
    });
    tables[13]=new DefaultTableModel(
    new Object [][] {},
    new String [] {
        "ID группы",  "ID проекта"//таблица "Группа"
    });
    tables[14]=new DefaultTableModel(
    new Object [][] {},
    new String [] {
        "ID", "Имя", "Фамилия", "Отчество", "Образование", "Должность", "Стаж работы","Научная степень"
    });//таблица "Конструкторы и инженеры"
    tables[15]=new DefaultTableModel(
    new Object [][] {},
    new String [] {
        "ID записи","Дата","Тип","Пользователь","ID сотрудника", "Имя", "Фамилия", "Отчество", "Образование", "Должность", "Стаж работы","ID группы","ID отдела"
    });//журнал учёта кадров
    tables[16]=new DefaultTableModel(
    new Object [][] {},
    new String [] {
        "ID записи","Дата","Тип","Пользователь","ID оборудования", "Тип оборудования", "Производитель", "Срок работы", "Рабочая нагрузка", "ID группы", "ID отдела"
    });//журнал учёта оборудования
    tables[17]=new DefaultTableModel(
    new Object [][] {},
    new String [] {
        "ID записи","Дата","Тип","Пользователь","ID договора",   "Заказчик", "Дата заключения","Дата завершения","Общая стоимость", "Общие затраты времени"
    });//журнал учёта выполнения договоров
     tables[18]=new DefaultTableModel(
    new Object [][] {},
    new String [] {
        "ID записи","Дата","Тип","Пользователь","ID проекта", "Стоимость", "Объём работ", "Дата старта", "Дата выполнения","ID договора","Статус"
    });//журнал учёта выполнения проектов
      tables[19]=new DefaultTableModel(
    new Object [][] {},//проекты фаст-костыль
    new String [] {
        "ID проекта", "Срок сдачи", "Стоимость", "Объём работ", "Дата старта", "Дата выполнения", "Статус", "ID договора", "ID руководителя"//таблица "Проекты"
    });
    }
    
    
    DefaultTableModel getTableModel(int type){
        return tables[type];
    }
}
